# coding: utf-8
# Pandasちゃんを召喚！
import pandas as pd

# CSVをデータフレーム化！
df = pd.read_csv('dd.csv')

#カラム内の文字数。デフォルトは50なので増やす！
pd.set_option("display.max_colwidth", 10000)

# 削除する列を指定
drop_col = ["公報番号","公報種別コード","発行国コード","公報番号(配布用)","公報種別コード(配布用)","発行国コード(配布用)","優先権主張番号","優先権主張日 - 最先","優先権主張年最先","出願番号","出願日","公報発行日","IPC - 最新","IPC 最新フル","IPC - 最新 - DWPI","CPC - 最新","CPC - 最新 - DWPI","FI コード","DWPI マニュアル コード","被引用特許数","譲受人/出願人","譲受人/出願人（1st）","出願人コード - DWPI","タイトル","タイトル - DWPI","抄録","抄録 (英語)","抄録 - DWPI","抄録 - DWPI 新規性","抄録 - DWPI 詳細な説明","抄録 - DWPI 活性","抄録 - DWPI 作用機序","抄録 - DWPI 用途","抄録 - DWPI 優位性","抄録 - DWPI テクノロジーフォーカス","請求項 1","請求項 1 - DWPI","DWPI ファミリーメンバー","種別","乱数","通番","DWPIアクセッション番号","DWPIアクセッション番号_lookup用","IPC*KWでの抽出","企業での抽出","公報番号.1"]

# 目的のデータ（キーワード列のみ取得！！）
dropped_df = df.drop(drop_col, axis=1)
print(dropped_df)